app/controllers/api/v1/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "<a href=\"%5C%22https://www.w3schools.com/%5C%22\"></a>"], ["created_at", "2021-02-11 14:07:26.918147"], ["updated_at", "2021-02-11 14:07:26.918147"]]
---
      def create
        message = Message.new(message_params)
        message.content = santize_content(message.content)
        if message.valid?
          message.save